IDEA StatiCa Open Model
CrossSectionFactory.FillSteelTI Method
Compatible with IDEA StatiCa Beta 21.0 - beta
 Fill steel T profile made from part of I profile
 Namespace: IdeaRS.OpenModel.CrossSection
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public static void FillSteelTI(
	CrossSectionParameter cssO,
	string name,
	double H
)
Public Shared Sub FillSteelTI (
	cssO As CrossSectionParameter,
	name As String,
	H As Double
)
public:
static void FillSteelTI(
	CrossSectionParameter^ cssO,
	String^ name,
	double H
)
Parameters
cssO
Type: IdeaRS.OpenModel.CrossSection.CrossSectionParameter
Parameters of CrossSectionParameter will be filled
name
Type: System.String
Name
H
Type: System.Double
Height
Return Value
Type:
See Also
Reference
CrossSectionFactory Class
IdeaRS.OpenModel.CrossSection Namespace